
/**
 * Backend:
 * - База данных Items с информацией о существующих элементах;
 * - База данных Project с информацие о сохранённых проектах;
 * -
 *
 * Fronend:
 * - Доделать Workshop с добавлением элементов под выбранную категорию;
 * - Привязать Workstate к элементам;
 * - Доделать Texture с выбором размера и поворота текстуры;
 * = Drag And Drop:
 * 	- выбор точек;
 * 	- выбор элементов;
 * - Доделать модуль авторизации;
 * - Сохранение проекта под ID текущего пользователя;
 * - Профиль пользователя с просмотром созданных проектов;
 * - Сохранение проектов в файлы;
 * - Открытие проектов из файлов;
 *
 */
